arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
/**
 * @file smd_sat.cpp
 * @brief SMD satellite device driver — state machine, TX, credentials, DFU.
 */

#include <cstdint>
#include <cstring>
#include <cmath>

#include "bsp.hpp"
#include "error.hpp"
#include "debug.hpp"
#include "gpio.hpp"
#include "scheduler.hpp"
#include "timer.hpp"
#include "binascii.hpp"
#include "smd_sat.hpp"
#include "pmu.hpp"

#include "nrf_delay.h"
#include "nrf_gpio.h"

extern Scheduler *system_scheduler;
extern Timer *system_timer;

#include "config_store.hpp"
extern ConfigurationStore *configuration_store;

// True when the BLIND MAC profile is active: ARGOS_BLIND_EN set AND the EFFECTIVE
// mode is not SURFACING_BURST/DOPPLER (they run their own nRF-paced bursts; a
// module-owned retx would double-transmit). Fills clamped retx_nb (1..127) and
// retx_period_s. Applies to both SMD transports (UART + SPI).
static bool smd_blind_active(unsigned int &retx_nb, unsigned int &retx_period_s) {
	if (!configuration_store) return false;
	// get_argos_configuration resolves the EFFECTIVE mode (LB/OoZ/HAULED) and
	// clears blind_en for SURFACING_BURST/DOPPLER. evaluate() inside is cached
	// (500 ms) and already runs many times per second, so this is cheap.
	ArgosConfig cfg;
	configuration_store->get_argos_configuration(cfg);
	if (!cfg.blind_en) return false;
	retx_nb = cfg.blind_retx_nb;
	if (retx_nb < 1)
		retx_nb = 1;
	else if (retx_nb > 127)
		retx_nb = 127;
	retx_period_s = cfg.blind_retx_period_s;
	return true;
}

// Runtime degraded-mode flag shared with smd_sat_cmd_spi.cpp via the inline
// accessors in smd_sat_registers.hpp. Default false — the autofallback path
// flips it when SMD_MAX_CONSECUTIVE_ERRORS is reached. Touched only by the
// SmdSat instance, but in scope here so SPI-level delays in cmd_spi can read
// it without needing a pointer back to SmdSat.
bool g_smdsat_use_safe_timings = false;

// Validation log helper — guarded by build-time flag (see scripts/build_*.sh
// --validation). Lets us tag state transitions / cooldown / degraded-mode
// events with a grep-friendly `[VAL-SAT]` prefix for post-deploy log analysis.
#ifndef VALIDATION_LOG_ENABLE
#define VALIDATION_LOG_ENABLE 0
#endif
#if VALIDATION_LOG_ENABLE
#define VAL_SAT(fmt, ...) DEBUG_INFO("[VAL-SAT] " fmt, ##__VA_ARGS__)
#else
#define VAL_SAT(fmt, ...) \
	do {                  \
	} while (0)
#endif

// SMD state-machine task priority — bumped above GNSS (M10Q uses DEFAULT_PRIORITY=7)
// so satellite TX path is not preempted by GPS init/fix work during surfacing burst.
// Lower number = higher priority (0 = highest, 7 = default).
static constexpr unsigned int SMD_SCHEDULER_PRIORITY = 4;

// TX latency instrumentation — call sites kept across the driver to allow
// re-enabling for future timing investigations. Currently NO-OP.
// To re-enable: uncomment the body and choose between console-only (fast, RTT/UART)
// or DEBUG_INFO (visible in system_log via DTE — but inflates total TX time by LFS commits;
// ping_ms isolated measurements remain accurate since t0 is captured after any prior log).
#define TXTRACE(fmt, ...)                        \
	do {                                         \
		(void)fmt;                               \
		/* DEBUG_INFO("[TXTRACE +%u ms] " fmt, \
            static_cast<unsigned>(m_tx_trace_start_ms ? (PMU::get_timestamp_ms() - m_tx_trace_start_ms) : 0), \
            ##__VA_ARGS__); */ \
	} while (0)

#define MODSWITCH_LOG(delta_ms, fmt, ...)                                                            \
	do {                                                                                             \
		(void)(delta_ms);                                                                            \
		(void)fmt;                                                                                   \
		/* DEBUG_INFO("[MODSWITCH +%u ms] " fmt, static_cast<unsigned>(delta_ms), ##__VA_ARGS__); */ \
	} while (0)

// ============================================================================
// Modulation conversion helpers (used by send() and switch_modulation())
// ============================================================================

static SmdArgosModulation kineis_to_smd_mod(KineisModulation mode) {
	switch (mode) {
	case KineisModulation::LDK: return ARGOS_MOD_LDK;
	case KineisModulation::VLDA4: return ARGOS_MOD_VLDA4;
	case KineisModulation::LDA2:
	default: return ARGOS_MOD_LDA2;
	}
}

static KineisModulation smd_to_kineis_mod(SmdArgosModulation mode) {
	switch (mode) {
	case ARGOS_MOD_LDK: return KineisModulation::LDK;
	case ARGOS_MOD_VLDA4: return KineisModulation::VLDA4;
	case ARGOS_MOD_LDA2:
	default: return KineisModulation::LDA2;
	}
}

// ============================================================================
// Constructor / Destructor
// ============================================================================

SmdSat::SmdSat(SmdSatCmd &cmd, unsigned int idle_shutdown_ms) : m_cmd(cmd) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	set_idle_timeout(idle_shutdown_ms);
	m_packet_buffer.clear();
	// Load cached modulation from config — set by the credentials-dirty path
	// after the last master RCONF write. Avoids defaulting to LDA2 every boot
	// (which would silently desync m_modulation from the actual programmed
	// RCONF when the user's master encodes LDK or VLDA4). Default 0 = LDA2.
	m_modulation = ARGOS_MOD_LDA2;
	if (configuration_store) {
		unsigned int cached = configuration_store->read_param<unsigned int>(ParamID::ARGOS_CACHED_MODULATION);
		switch (cached) {
		case 0: m_modulation = ARGOS_MOD_LDA2; break;
		case 1: m_modulation = ARGOS_MOD_LDK; break;
		case 2: m_modulation = ARGOS_MOD_VLDA4; break;
		default: m_modulation = ARGOS_MOD_LDA2; break;
		}
		DEBUG_INFO("SmdSat::ctor: loaded cached modulation=%u (-> enum=%d)", cached, static_cast<int>(m_modulation));
	}
	m_state = SmdSatState::stopped;
	m_stopping = false;
	m_state_counter = 0;
	m_next_delay = 0;
	m_tcxo_warmup_time = DEFAULT_TCXO_WARMUP_TIME_SECONDS;
	m_lpm_mode = 0x01;  // NONE by default
	m_tx_power = 0;
	m_tx_freq = 0.0;
	m_is_first_tx = true;
	this->shutdown();
	is_kmac_profil_loaded = false;
}

SmdSat::~SmdSat() {
	power_off_immediate();
}

// ============================================================================
// Power management
// ============================================================================

void SmdSat::shutdown(void) {
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);  // Hold RESET LOW
	nrf_delay_ms(SMDSAT_DELAY_RST_MS);
	GPIOPins::clear(SAT_PWR_EN);  // Cut power
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
#endif
	// Wait for VDD caps to discharge — ensures a true POR on next power_on.
	// Without this, the STM32WL stays alive on residual VDD (~10-50ms) and
	// resumes from its previous SPI sequence number, causing INVALID_CMD
	// when the nRF restarts with seq=0 after a soft reset.
	nrf_delay_ms(smdsat_vdd_discharge_ms());
	// NOTE: this is a static method — cannot stamp m_last_power_off_ms here.
	// The instance-level timestamp is set in power_off_immediate() instead.
}

