arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_error_exit() {}

/// @brief Defensive no-op: in normal flow this body never executes because
/// state_error_enter() always calls SMD_STATE_CHANGE(error, stopped) before
/// returning, so m_state is already 'stopped' by the time state_machine()
/// dispatches its next tick. Kept as a safety net: if state_error_enter()
/// is ever modified to return without transitioning (e.g. mid-refactor that
/// adds an async path), we still drop to 'stopped' here instead of looping
/// in error forever. The WARN log will surface the bug in field traces.
void SmdSat::state_error() {
	DEBUG_WARN("SmdSat::state_error: body reached — state_error_enter did not transit (regression?)");
	SMD_STATE_CHANGE(error, stopped);
}

#if SMDSAT_AUTOFALLBACK_ENABLED
/// @brief Load persisted SMD_DEGRADED_MODE flag on first SmdSat tick.
/// Reads ParamID::SMD_DEGRADED_MODE so a watchdog or power-cycle that
/// occurred while in SAFE mode keeps the SAFE timings on the next boot.
///
/// KNOWN LIMITATION (audit 2026-05 F1): only the SAFE/FAST flag is persisted —
/// m_safe_trust_window_hours always resets to 1 on boot. Consequence on a
/// sealed 1-year deployment: every WDT/POR reset while in SAFE mode triggers
/// a FAST retest 1 h post-boot regardless of where the doubling chain had
/// reached before (could have been 8 h, 16 h, 24 h). Cost ≈ 3 wasted TXes per
/// failed FAST retest. If reboots are rare (annual deployment, well-tested
/// firmware) the impact is bounded; if reboots become frequent the FAST/SAFE
/// chain effectively collapses to "always retest at 1 h", which is the
/// same behavior as a fresh device entering SAFE for the first time.
/// Fix path if needed: encode the window in SMD_DEGRADED_MODE itself
/// (0=FAST, N>0=SAFE/N-hours) and persist on every doubling.
///
/// KNOWN LIMITATION (audit 2026-05 F2): m_safe_mode_since_ms is reset to
/// PMU::get_timestamp_ms() at load time, i.e. boot timestamp — not the real
/// UTC moment when SAFE was engaged. degraded_mode_note_success() therefore
/// measures "hours in SAFE since this boot" rather than "hours since SAFE
/// was actually engaged". A boot that happens 23 h into SAFE waits a full
/// new trust window (24 h potentially) instead of retesting promptly.
/// Fix path if needed: persist RTC UTC timestamp at engage time, compare
/// against RTC on load.
void SmdSat::degraded_mode_load_if_needed() {
	if (m_degraded_mode_loaded) return;
	m_degraded_mode_loaded = true;
	unsigned int persisted = configuration_store->read_param<unsigned int>(ParamID::SMD_DEGRADED_MODE);
	if (persisted != 0) {
		g_smdsat_use_safe_timings = true;
		m_safe_mode_since_ms = PMU::get_timestamp_ms();
		m_safe_mode_tx_count = 0;
		DEBUG_INFO("SmdSat: degraded mode restored from flash — SAFE timings active");
		VAL_SAT("degraded_mode_load persisted=1 -> SAFE timings active");
	} else {
		VAL_SAT("degraded_mode_load persisted=0 -> FAST timings active");
	}
}

/// @brief Flip to SAFE timings on consecutive-error threshold.
/// First engagement: persist the flag so a reboot keeps us safe.
/// Re-entry while already in SAFE: a FAST retest just failed, so double the
/// trust window (cap 24h) before the next retest attempt.
void SmdSat::degraded_mode_engage() {
	if (!g_smdsat_use_safe_timings) {
		g_smdsat_use_safe_timings = true;
		m_safe_mode_since_ms = PMU::get_timestamp_ms();
		m_safe_mode_tx_count = 0;
		m_safe_trust_window_hours = 1;
		configuration_store->write_param(ParamID::SMD_DEGRADED_MODE, 1U);
		DEBUG_ERROR("SmdSat: degraded mode ENGAGED — SAFE timings, retest in %u h", m_safe_trust_window_hours);
		VAL_SAT("degraded_mode_engage trust_window_h=%u (first engage)", m_safe_trust_window_hours);
	} else {
		// We were already in SAFE and just hit the threshold again — the
		// previous FAST retest failed, double the window.
		if (m_safe_trust_window_hours < SAFE_TRUST_WINDOW_MAX_H) {
			m_safe_trust_window_hours = m_safe_trust_window_hours * 2;
			if (m_safe_trust_window_hours > SAFE_TRUST_WINDOW_MAX_H)
				m_safe_trust_window_hours = SAFE_TRUST_WINDOW_MAX_H;
		}
		m_safe_mode_since_ms = PMU::get_timestamp_ms();
		m_safe_mode_tx_count = 0;
		DEBUG_WARN("SmdSat: FAST retest failed — next retest in %u h", m_safe_trust_window_hours);
		VAL_SAT("degraded_mode_engage trust_window_h=%u (retest_failed)", m_safe_trust_window_hours);
	}
}

/// @brief Count successful TXes while in SAFE; retest FAST once the trust
/// window has elapsed AND enough TXes have succeeded.
void SmdSat::degraded_mode_note_success() {
	if (!g_smdsat_use_safe_timings) return;
	m_safe_mode_tx_count++;
	uint64_t hours_in_safe = (PMU::get_timestamp_ms() - m_safe_mode_since_ms) / (3600ULL * 1000ULL);
	if (m_safe_mode_tx_count >= SAFE_RETEST_MIN_TX && hours_in_safe >= m_safe_trust_window_hours) {
		g_smdsat_use_safe_timings = false;
		configuration_store->write_param(ParamID::SMD_DEGRADED_MODE, 0U);
		DEBUG_INFO("SmdSat: retesting FAST timings (was SAFE %lu h, %u successful TX)",
		           static_cast<unsigned long>(hours_in_safe), m_safe_mode_tx_count);
		VAL_SAT("retest_fast hours_in_safe=%lu tx_count=%u", static_cast<unsigned long>(hours_in_safe),
		        m_safe_mode_tx_count);
	}
}

/// @brief Cascade-failure detector: TX cancelled externally (dive event or
/// service_cancel) while state_transmitting had consumed a significant
/// fraction of its polling budget. Treats it as 1 consecutive error so the
/// autofallback can trip without waiting for the natural ~13-15s timeout —
/// matters because dive/surface flapping pre-empts that timeout in practice.
/// Idempotent: marks the snapshot consumed so a repeated stop_send/power_off
/// in the same TX cycle doesn't double-count.
void SmdSat::degraded_mode_note_tx_cancelled_during_cascade() {
	if (m_state != transmitting || m_initial_tx_state_counter == 0) return;
	unsigned int consumed = m_initial_tx_state_counter - m_state_counter;
	bool cascade =
	    (consumed * TX_CASCADE_FAILURE_DENOMINATOR) >= (m_initial_tx_state_counter * TX_CASCADE_FAILURE_NUMERATOR);
	m_initial_tx_state_counter = 0;  // Idempotent — consumed.
	if (!cascade) return;
	m_error_count++;
	DEBUG_WARN("SmdSat: TX cancelled after %u/%u failed polls — counting toward autofallback (m_error_count=%u/%u)",
	           consumed, consumed + m_state_counter, m_error_count, SMD_MAX_CONSECUTIVE_ERRORS);
	if (m_error_count >= SMD_MAX_CONSECUTIVE_ERRORS) {
		m_cooldown_until = PMU::get_timestamp_ms() + SMD_ERROR_COOLDOWN_MS;
		DEBUG_ERROR("SmdSat: %u consecutive cascade errors — cooldown for %u min", m_error_count,
		            SMD_ERROR_COOLDOWN_MS / 60000);
		m_error_count = 0;
		degraded_mode_engage();
	}
}
#endif  // SMDSAT_AUTOFALLBACK_ENABLED

void SmdSat::state_stopped_enter() {
	m_cmd.deinit();

	// Release wakeup pin LOW so SMD can enter deep sleep (STANDBY/SHUTDOWN)
	// before power is cut. This allows the STM32 to enter LPM immediately.
#ifdef SAT_EXTWAKEUP
	GPIOPins::clear(SAT_EXTWAKEUP);
#endif

	this->shutdown();
	GPIOPins::release_sensors_pwr();
	nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);

	// Stamp power-off timestamp so the next state_powering_on can skip the
	// redundant VDD discharge wait if the dive was long enough for natural
	// decay. Saves 50 ms (FAST) / 100 ms (SAFE) on the first Doppler at
	// surface for the sealed turtle case (dive duration minutes).
	m_last_power_off_ms = PMU::get_timestamp_ms();

	// Force entry to state_load_kmac on next boot for TCXO/LPM writes (RAM registers).
	// The explicit load_kmac_profil SPI command is only sent when RCONF changed
	// (m_needs_explicit_kmac_load) — otherwise STM32 auto-inits MAC from flash at POR.
	is_kmac_profil_loaded = false;

	m_packet_buffer.clear();

	notify(KineisEventPowerOff({}));
}

void SmdSat::state_stopped_exit() {}
void SmdSat::state_stopped() {}

