arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	// Step 2: Send load_kmac_profil only when RCONF/credentials changed.
	// When unchanged, the STM32 auto-initializes MAC from flash at POR —
	// we just wait for MAC_OK in step 3.
	// BLIND MAC profile (both SMD transports — UART + SPI). Push the KMAC profile
	// when: RCONF changed, blind is ON (its ctx must reach the MAC each session —
	// a blind toggle isn't flagged RCONF-dirty and blind may not be flash-
	// persisted), or we must switch back to BASIC after a blind session. Else keep
	// the flash-auto-init optimization (steady-state BASIC pushes nothing — the
	// existing SPI/RSPB boot timing is unchanged). Graceful: if the module rejects
	// profile 2, fall back to BASIC (over SPI, BASIC sends the id only — 1 byte,
	// unchanged — backward-compatible with pre-blind firmware).
	unsigned int rn = 0, period = 0;
	bool blind_en = smd_blind_active(rn, period);
	if (m_needs_explicit_kmac_load || blind_en || m_kmac_blind_pushed) {
		try {
			if (blind_en) {
				// KNS_MAC_BLIND_usrCfg_t packed, little-endian:
				// {int8 retx_nb, uint8 nb_parallel_msg=1, uint32 retx_period_s, int8 per_offset=0}
				uint8_t ctx[7] = { (uint8_t)rn,
				                   1,
				                   (uint8_t)(period & 0xFF),
				                   (uint8_t)((period >> 8) & 0xFF),
				                   (uint8_t)((period >> 16) & 0xFF),
				                   (uint8_t)((period >> 24) & 0xFF),
				                   0 };
				try {
					m_cmd.load_kmac_profil(2, ctx, sizeof(ctx));
					m_kmac_blind_pushed = true;
					DEBUG_INFO("SmdSat::%s: BLIND KMAC loaded (retx_nb=%u period=%us)", __func__, rn, period);
				} catch (...) {
					DEBUG_WARN("SmdSat::%s: BLIND KMAC (profile 2) rejected — falling back to BASIC", __func__);
					m_cmd.load_kmac_profil(1);
					m_kmac_blind_pushed = false;
				}
			} else {
				TXTRACE("state_load_kmac: sending explicit load_kmac_profil(1)");
				m_cmd.load_kmac_profil(1);
				m_kmac_blind_pushed = false;
			}
			m_needs_explicit_kmac_load = false;
		} catch (...) {
			DEBUG_ERROR("SmdSat::%s: KMAC load failed", __func__);
			SMD_STATE_CHANGE(load_kmac, error);
			return;
		}
	} else {
		TXTRACE("state_load_kmac: skip explicit KMAC (STM32 auto-inits from flash)");
	}

	// Step 3: Poll READ_SPIMAC_STATE (0x27) for MAC ready.
	// After explicit load_kmac_profil: MAC resets to MAC_OK (0x01).
	// After STM32 auto-init from flash at POR: MAC reports last session status
	// (e.g. MAC_TX_DONE after a successful TX). Any state except UNKNOWN (not
	// initialized), ERROR (init failed), and TX_IN_PROGRESS (busy) means the
	// MAC has initialized from flash and is ready to accept TX commands.
	uint8_t spi_st = 0, mac_st = 0;
	try {
		m_cmd.read_spimac_state(&spi_st, &mac_st);
	} catch (...) {}
	bool mac_ready = (mac_st != MAC_UNKNOWN && mac_st != MAC_ERROR && mac_st != MAC_TX_IN_PROGRESS);
	if (mac_ready) {
		is_kmac_profil_loaded = true;
		TXTRACE("state_load_kmac: MAC READY (mac=%u spi=%u) -> writing TCXO+LPM, then idle", mac_st, spi_st);
		DEBUG_TRACE("SmdSat::%s: MAC ready (mac=%u, explicit_load=%u)", __func__, mac_st, m_needs_explicit_kmac_load);

		// Step 4: Write TCXO warmup — RAM register on STM32, lost on power cycle.
		// Force 0 on first TX after power-on: TCXO was just powered, no warmup needed.
		// Configured value is rewritten in state_transmitting_exit after the first TX.
		// Safety: if die temperature is below TCXO_SKIP_TEMP_THRESHOLD_C, fall back to
		// the configured warmup so a cold TCXO (deep dive → quick surface in cold
		// water) doesn't TX off-frequency. Affects only the first TX of the burst;
		// subsequent TXes already use the configured warmup.
		int die_temp_c = PMU::get_die_temperature_c();
		bool tcxo_skip = m_is_first_tx && (die_temp_c >= TCXO_SKIP_TEMP_THRESHOLD_C);
		uint32_t warmup_ms = tcxo_skip ? 0 : (m_tcxo_warmup_time * 1000);
		if (m_is_first_tx && !tcxo_skip) {
			DEBUG_INFO("SmdSat::%s: cold die temp (%d °C < %d) — keeping TCXO warmup", __func__, die_temp_c,
			           TCXO_SKIP_TEMP_THRESHOLD_C);
		}
		try {
			m_cmd.write_tcxo_warmup(warmup_ms);
			DEBUG_TRACE("SmdSat::%s: TCXO warmup written: %u ms (first_tx=%u)", __func__, warmup_ms, m_is_first_tx);
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: failed to write TCXO warmup", __func__);
		}

		// Write LPM mode if not NONE — RAM register on STM32.
		if (m_lpm_mode != 0x01) {
			try {
				m_cmd.write_lpm(&m_lpm_mode);
				DEBUG_TRACE("SmdSat::%s: LPM mode written: 0x%02X", __func__, m_lpm_mode);
			} catch (...) {
				DEBUG_WARN("SmdSat::%s: failed to write LPM mode", __func__);
			}
		}

		// First-TX shortcut (2026-05 optim Cible #2): if a packet is already
		// queued (typical surfacing-burst path where send() set m_packet_buffer
		// before triggering power_on), skip state_idle entirely and go straight
		// to transmit_pending. Saves ~40-100 ms of scheduler latency (10 ms wait
		// after state_idle_enter + 30 ms wait after state_idle_exit + a scheduler
		// context switch). Falls back to the regular idle transition when no
		// packet is pending (e.g. DTE-initiated set_credentials boot).
		if (m_packet_buffer.length() > 0) {
			m_tx_buffer = m_packet_buffer;
			m_packet_buffer.clear();
			SMD_STATE_CHANGE(load_kmac, transmit_pending);
		} else {
			// Go directly to idle — SPI bus already confirmed working by
			// read_spimac_state + write_tcxo above. No need for a second ping.
			SMD_STATE_CHANGE(load_kmac, idle);
		}
	} else if (mac_st == MAC_ERROR && !m_rconf_recovery_attempted) {
		// Recovery: MAC_ERROR means RCONF in STM32 flash is corrupted or missing.
		// Force-write the master RCONF, save to flash, then re-attempt KMAC load.
		// NOTE: the "attempted" latch is set only AFTER a successful write (below),
		// not here — otherwise a throw mid-recovery would permanently disable the
		// retry and leave the SMD stuck in error→cooldown on a recoverable glitch.
		DEBUG_WARN("SmdSat::%s: MAC_ERROR — attempting RCONF recovery", __func__);
		if (configuration_store) {
			std::string radioconf = configuration_store->read_param<std::string>(ParamID::ARGOS_RADIOCONF);
			if (!radioconf.empty() && radioconf.size() >= 2 && (radioconf.size() % 2) == 0) {
				auto wait_cmd = []() { nrf_delay_ms(150); };
				std::string rconf_bin = Binascii::unhexlify(radioconf);
				smd_uint8_array_t rconf_struct = { static_cast<uint16_t>(rconf_bin.size()),
				                                   reinterpret_cast<uint8_t *>(rconf_bin.data()) };
				try {
					m_cmd.set_radio_conf(&rconf_struct);
					wait_cmd();
					m_cmd.save_radio_conf();
					wait_cmd();
					m_needs_explicit_kmac_load = true;  // Force KMAC reload after recovery
					is_kmac_profil_loaded = false;
					m_state_counter = 10;               // Reset poll counter for MAC_OK after recovery
					m_rconf_recovery_attempted = true;  // mark done only on success
					DEBUG_INFO("SmdSat::%s: RCONF recovery written — retrying KMAC", __func__);
					m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
					return;  // Re-enter state_load_kmac on next tick
				} catch (...) {
					DEBUG_ERROR("SmdSat::%s: RCONF recovery write failed", __func__);
				}
			}
		}
		SMD_STATE_CHANGE(load_kmac, error);
	} else {
		if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: MAC not OK after KMAC load (spi=%u mac=%u)", __func__, spi_st, mac_st);
			// Auto-init failed — force explicit KMAC load on next boot to recover.
			// Without this, m_needs_explicit_kmac_load stays false and we'd loop
			// through the same timeout on every subsequent boot attempt.
			m_needs_explicit_kmac_load = true;
			SMD_STATE_CHANGE(load_kmac, error);
		} else {
			TXTRACE("state_load_kmac: MAC NOT ready (mac=%u spi=%u) retry in %u ms (left=%u)", mac_st, spi_st,
			        smdsat_delay_load_kmac_ms(), m_state_counter);
			m_next_delay = smdsat_delay_load_kmac_ms();
		}
	}
}

void SmdSat::state_idle_pending_enter() {
	TXTRACE("state_idle_pending_enter: init SPI, will ping STM32");
	// Init SPI here (after power-on + reset release) to avoid MISO backfeed.
	// STM32WL has booted and its GPIOs are in a defined state now.
	m_cmd.init();
	m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
	m_state_counter = 10;
}

