arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_transmit_pending() {
	if (m_tx_buffer.size()) {
		TXTRACE("state_transmit_pending: calling initiate_tx (%u bytes)", static_cast<unsigned>(m_tx_buffer.size()));
		// Release VPA just before TX — PA regulator needs to be enabled for RF output
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
		DEBUG_TRACE("SmdSat::%s: VPA released for TX", __func__);
#endif
		bool tx_started = false;
		try {
			// Keep every repeat of the same message on one Argos MC (RSPB).
			apply_message_counter_hold();
			tx_started = m_cmd.initiate_tx(m_tx_buffer);
		} catch (...) {
			// Both calls reach send_command_aplus, which throws
			// ErrorCode::SPI_COMMS_ERROR on a transient SPIM fault: initiate_tx
			// directly, apply_message_counter_hold via read/set_message_counter
			// (send_command_auto / send_command_2phase both funnel into aplus).
			// Absorb it here, like every other SPI call in this driver, so it
			// routes to the SMD error state + cooldown + autofallback
			// accounting. Letting it unwind instead reaches a global ErrorEvent
			// that bypasses SMD recovery entirely and leaves m_tx_buffer stale.
			//
			// Aborting the TX when only the MC hold threw is deliberate: a throw
			// there means the SPI link is already faulting, so initiate_tx would
			// almost certainly follow, and the error state is what drives
			// recovery.
			DEBUG_ERROR("SmdSat::%s: TX setup threw (SPI) — aborting TX", __func__);
			tx_started = false;
		}
		if (!tx_started) {
			DEBUG_ERROR("SmdSat::%s: initiate_tx failed, aborting TX", __func__);
			m_tx_buffer.clear();
			SMD_STATE_CHANGE(transmit_pending, error);
			return;
		}
		TXTRACE("state_transmit_pending: initiate_tx OK, TX started on STM32");
		notify(KineisEventTxStarted({}));
		SMD_STATE_CHANGE(transmit_pending, transmitting);
	} else if (--m_state_counter == 0) {
		DEBUG_ERROR("SmdSat::%s: failed accept SEND command", __func__);
		SMD_STATE_CHANGE(transmit_pending, error);
	} else {
		m_next_delay = SMDSAT_DELAY_STATE_TICK_MS;
	}
}

void SmdSat::state_transmitting_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	uint32_t total_timeout_ms = (m_tcxo_warmup_time * 1000) + 5000;
	// BLIND: the module transmits retx_nb copies retx_period_s apart before it
	// reports +TX — extend the poll window to cover the whole burst.
	unsigned int rn = 0, period = 0;
	if (smd_blind_active(rn, period)) {
		// uint64 intermediate: rn(<=127) * period(<=65535) * 1000 overflows uint32.
		// Cap at 2 h so an extreme config can't park the service indefinitely.
		uint64_t burst_ms = (uint64_t)rn * (uint64_t)period * 1000ULL;
		if (burst_ms > 7200000ULL) burst_ms = 7200000ULL;
		total_timeout_ms += (uint32_t)burst_ms;
		DEBUG_INFO("SmdSat::%s: BLIND — TX poll window +%u ms (burst)", __func__, (uint32_t)burst_ms);
	}
	m_state_counter = (total_timeout_ms / smdsat_timing_tx_poll_ms()) + 1;
#if SMDSAT_AUTOFALLBACK_ENABLED
	// Snapshot for cascade-failure detection in stop_send / power_off_immediate.
	m_initial_tx_state_counter = m_state_counter;
#endif
	DEBUG_TRACE("SmdSat::%s: poll timeout=%ums | counter=%u", __func__, total_timeout_ms, m_state_counter);
}

void SmdSat::state_transmitting_exit() {
	// First TX done: restore configured TCXO warmup on STM32 for subsequent TX
	// in THIS session (RAM register, lost on power cycle). This does NOT touch the
	// fast first-TX path (state_load_kmac forces warmup=0 when the TCXO is already
	// warm) — it only makes sure every *subsequent* in-session TX gets the real
	// warmup, so the carrier doesn't drift off-frequency and lose the Argos pass.
	//
	// The STM32WL is not ready for a fresh SPI command in the few ms right after
	// MAC_TX_DONE: the field log showed REQ 0x29 → "IDLE pattern, no response
	// ready" on all 3 instant auto-retries, leaving the warmup stuck at 0 for the
	// rest of the burst. Give it a settle window and a few spaced attempts so the
	// restore actually lands.
	if (m_is_first_tx && m_tcxo_warmup_time > 0) {
		static constexpr uint8_t TCXO_RESTORE_ATTEMPTS = 3;
		static constexpr uint32_t TCXO_RESTORE_SETTLE_MS = 50;  // STM32WL post-TX settle
		bool restored = false;
		for (uint8_t attempt = 0; attempt < TCXO_RESTORE_ATTEMPTS && !restored; attempt++) {
			nrf_delay_ms(TCXO_RESTORE_SETTLE_MS);
			try {
				m_cmd.write_tcxo_warmup(m_tcxo_warmup_time * 1000);
				DEBUG_TRACE("SmdSat::%s: restored TCXO warmup: %u s (attempt %u)", __func__, m_tcxo_warmup_time,
				            attempt + 1);
				restored = true;
			} catch (...) {
				DEBUG_WARN("SmdSat::%s: TCXO warmup restore attempt %u/%u failed", __func__, attempt + 1,
				           TCXO_RESTORE_ATTEMPTS);
			}
		}
	}
	// Clear unconditionally: the first TX of every session is re-armed by
	// state_starting() (m_is_first_tx=true on each power_on), so this never
	// affects the fast first-TX path — it only governs in-session subsequent TX.
	m_is_first_tx = false;
	// Drive VPA LOW after TX — PA regulator no longer needed
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
	DEBUG_TRACE("SmdSat::%s: VPA driven LOW after TX", __func__);
#endif
}

void SmdSat::state_transmitting() {
	if (m_cmd.is_tx_finished()) {
		if (m_tx_buffer.size()) {
			TXTRACE("state_transmitting: TX FINISHED — total elapsed");
			m_tx_buffer.clear();
			// is_tx_finished() returns true for MAC_TX_DONE (real success),
			// MAC_TX_TIMEOUT (no satellite reception), AND MAC_ERROR (hard
			// failure). Only MAC_TX_DONE should fire KineisEventTxComplete —
			// otherwise AFTER_LAST_TX cooldown arms on a failed TX and locks
			// out the whole surface cycle even though no packet was sent.
			bool tx_success = m_cmd.is_tx_successful();
			if (!tx_success) {
				TXTRACE("state_transmitting: TX FAILED (timeout/error) — notifying DeviceError");
				notify(KineisEventDeviceError({}));
				SMD_STATE_CHANGE(transmitting, stopped);
				return;
			}
			m_error_count = 0;  // TX success — reset consecutive error counter
#if SMDSAT_AUTOFALLBACK_ENABLED
			// Autofallback: track successful TXes while in SAFE so the
			// trust window can close and we retest FAST.
			degraded_mode_note_success();
#endif
			DEBUG_TRACE("SmdSat::%s: notify KineisEventTxComplete", __func__);
			notify(KineisEventTxComplete({}));
		}
		SMD_STATE_CHANGE(transmitting, stopped);
	} else {
		if (!m_tx_buffer.size()) {
			SMD_STATE_CHANGE(transmitting, stopped);
		} else if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: TX timeout after polling", __func__);
			SMD_STATE_CHANGE(transmitting, error);
		} else {
			TXTRACE("state_transmitting: not finished, poll again in %u ms (left=%u)", smdsat_timing_tx_poll_ms(),
			        m_state_counter);
			m_next_delay = smdsat_timing_tx_poll_ms();
		}
	}
}

// ============================================================================
// KineisDevice interface
// ============================================================================

void SmdSat::stop_send() {
	DEBUG_TRACE("SmdSat::%s", __func__);
#if SMDSAT_AUTOFALLBACK_ENABLED
	// Soft-cancel path (service_cancel timeout / similar) — apply the same
	// cascade detector as power_off_immediate so cancellations during an
	// ongoing SPI poll cascade still count toward the autofallback.
	degraded_mode_note_tx_cancelled_during_cascade();
#endif
	m_packet_buffer.clear();
	m_tx_buffer.clear();
}

void SmdSat::start_receive(const KineisModulation mode) {
	(void)mode;
	DEBUG_TRACE("SmdSat::%s: Not supported", __func__);
}

bool SmdSat::stop_receive() {
	DEBUG_TRACE("SmdSat::%s: Not supported", __func__);
	return false;
}

