arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::set_frequency(double freq_mhz) {
	DEBUG_TRACE("SmdSat::%s", __func__);
	m_tx_freq = freq_mhz;
}

unsigned int SmdSat::cooldown_remaining_ms() const {
	if (m_cooldown_until == 0) return 0;
	uint64_t now = PMU::get_timestamp_ms();
	return (now < m_cooldown_until) ? static_cast<unsigned int>(m_cooldown_until - now) : 0;
}

void SmdSat::send(const KineisModulation mode, const KineisPacket &user_payload, const unsigned int payload_length) {
	m_tx_trace_start_ms = PMU::get_timestamp_ms();
	TXTRACE("send() entered: mode=%d state=%d first_tx=%u tcxo_warmup=%u s", static_cast<int>(mode),
	        static_cast<int>(m_state), m_is_first_tx, m_tcxo_warmup_time);

#if SMDSAT_AUTOFALLBACK_ENABLED
	// Lazy sync of runtime flag from persisted param. Lets a DTE PARMW SMP00=0
	// (operator-triggered manual clear after a confirmed root-cause fix) take
	// effect at the next TX without requiring a reboot. The runtime flag
	// `g_smdsat_use_safe_timings` is otherwise only set at boot via
	// `degraded_mode_load_if_needed()` and by `degraded_mode_engage()`. The
	// reverse direction (param=1 while flag=false) cannot happen because DTE
	// PARMW rejects SMP00=1 (see dte_handler.cpp::PARMW_REQ); only
	// degraded_mode_engage() can set param=1, and it also sets the flag.
	if (g_smdsat_use_safe_timings && configuration_store
	    && configuration_store->read_param<unsigned int>(ParamID::SMD_DEGRADED_MODE) == 0) {
		DEBUG_INFO("SmdSat::send: DTE-cleared degraded mode — re-engaging FAST timings");
		VAL_SAT("degraded_mode_cleared_via_dte -> FAST timings");
		g_smdsat_use_safe_timings = false;
		m_safe_mode_tx_count = 0;
		m_safe_trust_window_hours = 1;
		m_safe_mode_since_ms = 0;
	}
#endif

	// Reject operations during error cooldown — prevents SPI spam when SMD is unresponsive
	if (m_cooldown_until > 0 && PMU::get_timestamp_ms() < m_cooldown_until) {
		unsigned int remaining_ms = static_cast<unsigned int>(m_cooldown_until - PMU::get_timestamp_ms());
		DEBUG_WARN("SmdSat::%s: in cooldown (%u min remaining) — TX rejected", __func__, remaining_ms / 60000);
		VAL_SAT("send_rejected_cooldown remaining_ms=%u", remaining_ms);
		notify(KineisEventDeviceError({}));
		return;
	}
	if (m_cooldown_until > 0) {
		VAL_SAT("cooldown_expired_naturally");
	}
	m_cooldown_until = 0;  // Cooldown expired — allow operation

	DEBUG_TRACE("SmdSat::%s: length %u mode=%d current=%d", __func__, payload_length, static_cast<int>(mode),
	            static_cast<int>(m_modulation));
	SmdArgosModulation requested = kineis_to_smd_mod(mode);
	if (requested != m_modulation) {
		DEBUG_WARN("SmdSat::%s: TX mode %d != current modulation %d — call switch_modulation() first", __func__,
		           static_cast<int>(requested), static_cast<int>(m_modulation));
	}

	unsigned int max_payload_size = 0;
	switch (m_modulation) {
	case ARGOS_MOD_LDA2: max_payload_size = ARGOS_TX_LDA2_PAYLOAD_BYTE_SIZE; break;
	case ARGOS_MOD_LDK: max_payload_size = ARGOS_TX_LDK_PAYLOAD_BYTE_SIZE; break;
	case ARGOS_MOD_VLDA4: max_payload_size = ARGOS_TX_VLDA4_PAYLOAD_BYTE_SIZE; break;
	default: DEBUG_TRACE("SmdSat::%s: Unknown modulation type %d", __func__, m_modulation); return;
	}

	unsigned int effective_payload_length = std::min(payload_length, static_cast<unsigned int>(user_payload.size()));
	if (effective_payload_length > max_payload_size) {
		DEBUG_ERROR("SmdSat::%s: Payload truncated from %u to %u bytes", __func__, effective_payload_length,
		            max_payload_size);
		effective_payload_length = max_payload_size;
	}

	unsigned int padded_size = max_payload_size;
	if (m_modulation == ARGOS_MOD_LDA2) {
		padded_size = ((effective_payload_length + ARGOS_TX_LDA2_SIZE_STEP - 1) / ARGOS_TX_LDA2_SIZE_STEP)
		              * ARGOS_TX_LDA2_SIZE_STEP;
		if (padded_size < ARGOS_TX_LDA2_MIN_BYTE_SIZE) padded_size = ARGOS_TX_LDA2_MIN_BYTE_SIZE;
		if (padded_size > max_payload_size) padded_size = max_payload_size;
		DEBUG_TRACE("SmdSat::%s: LDA2 padded %u -> %u bytes", __func__, effective_payload_length, padded_size);
	}

	m_packet_buffer.assign(padded_size, 0);
	std::copy(user_payload.begin(), user_payload.begin() + effective_payload_length, m_packet_buffer.begin());

	DEBUG_TRACE("SmdSat::%s: raw data[%u]=%s", __func__, effective_payload_length,
	            Binascii::hexlify(m_packet_buffer).c_str());

	DEBUG_TRACE("SmdSat::%s::Packet size %u", __func__, static_cast<unsigned int>(m_packet_buffer.size()));

	TXTRACE("send() calling power_on() (payload built, %u bytes)", static_cast<unsigned>(m_packet_buffer.size()));

	power_on();
}

void SmdSat::set_tcxo_warmup_time(unsigned int time_s) {
	m_tcxo_warmup_time = time_s;
}

void SmdSat::set_lpm_mode(uint8_t lpm_bitmap) {
#ifdef BENCH_FORCE_LPM_NONE
	// Bench diagnostic: force LPM=NONE (0x01) so the SMD never enters SLEEP/STOP.
	// Isolates whether an SPI failure is the module failing to wake from a
	// low-power mode (e.g. config SMD_LPM_MODE=4=STOP with an SMD firmware built
	// without LPM) vs a genuine SPI hardware/protocol problem.
	DEBUG_WARN("SmdSat::set_lpm_mode: BENCH_FORCE_LPM_NONE — forcing NONE (was 0x%02X)", lpm_bitmap);
	m_lpm_mode = 0x01;
	return;
#endif
	// Sanitize: STANDBY(0x08) and SHUTDOWN(0x10) require SAT_EXTWAKEUP pin
#ifndef SAT_EXTWAKEUP
	if (lpm_bitmap & 0x18) {
		DEBUG_WARN("SmdSat::%s: STANDBY/SHUTDOWN disabled (no SAT_WKUP pin), masking to 0x%02X", __func__,
		           lpm_bitmap & 0x07);
		lpm_bitmap &= 0x07;  // Keep only NONE|SLEEP|STOP
	}
#endif
	if (lpm_bitmap == 0) lpm_bitmap = 0x01;  // Fallback to NONE
	m_lpm_mode = lpm_bitmap;
}

void SmdSat::set_tx_power(unsigned int power) {
	m_tx_power = power;
}

// ============================================================================
// Auto-write credentials from config store at boot
// ============================================================================


/**
 * @brief Whether the module holds what it needs to actually transmit.
 *
 * The SMD refuses to emit without a 16-byte secret key and a radio config, and
 * write_credentials_from_config() applies exactly those two checks before it
 * writes anything. Repeating them here lets the scheduler hold the TX instead
 * of scheduling one that dies inside send() -- by which point retrieve() has
 * already spent the position's burst credit and lost it.
 */
bool SmdSat::can_transmit() const {
	if (!configuration_store) return false;
	const std::string seckey = configuration_store->read_param<std::string>(ParamID::ARGOS_SECKEY);
	const std::string radioconf = configuration_store->read_param<std::string>(ParamID::ARGOS_RADIOCONF);
	return seckey.size() == 32 && radioconf.size() >= 2 && (radioconf.size() % 2) == 0;
}
bool SmdSat::write_credentials_from_config() {
	if (!configuration_store) return false;

	// Flash write operations need ~100ms for persistence.
	// Previous delay (SMDSAT_DELAY_CMD_MS*2 = 60ms) was insufficient.
	//
	// KNOWN LIMITATION (audit 2026-05 F5): no PMU::kick_watchdog() between the
	// per-cmd wait_cmd() calls. Total worst case here is ~7 SPI writes × ~150ms
	// = ~1.1 s blocking. The 15-min WDT budget swallows this comfortably, but
	// if a future SPI cmd grows internal retries (e.g. cascade backoff) the
	// margin shrinks. Add a kick mid-routine if you ever extend this sequence
	// past ~5 s of blocking work. NOT a current bug — flagged for awareness.
	auto wait_cmd = []() { nrf_delay_ms(120); };

	unsigned int dec_id = configuration_store->read_param<unsigned int>(ParamID::ARGOS_DECID);
	unsigned int address = configuration_store->read_param<unsigned int>(ParamID::ARGOS_HEXID);
	std::string seckey = configuration_store->read_param<std::string>(ParamID::ARGOS_SECKEY);
	std::string radioconf = configuration_store->read_param<std::string>(ParamID::ARGOS_RADIOCONF);

	// Skip if credentials are not configured yet
	if (seckey.empty() || radioconf.empty()) {
		DEBUG_WARN("SmdSat::%s: credentials not configured (seckey=%u rconf=%u) | skipping", __func__,
		           static_cast<unsigned>(seckey.size()), static_cast<unsigned>(radioconf.size()));
		return true;  // Not an error, just nothing to write
	}

	// Validate credential sizes before writing (seckey = 16 bytes = 32 hex chars)
	if (seckey.size() != 32) {
		DEBUG_ERROR("SmdSat::%s: invalid seckey length %u (expected 32 hex chars)", __func__,
		            static_cast<unsigned>(seckey.size()));
		return false;
	}
	if (radioconf.size() < 2 || (radioconf.size() % 2) != 0) {
		DEBUG_ERROR("SmdSat::%s: invalid radioconf length %u (must be even hex string)", __func__,
		            static_cast<unsigned>(radioconf.size()));
		return false;
	}

	DEBUG_INFO("SmdSat::%s: writing credentials from config store (id=%u addr=0x%08X)", __func__, dec_id, address);

