arribada/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	try {
		m_cmd.write_cw(payload, static_cast<uint16_t>(len));
		return true;
	} catch (...) {
		DEBUG_ERROR("SmdSat::cw_start: write_cw threw");
		return false;
	}
}

bool SmdSat::cw_stop() {
	DEBUG_INFO("SmdSat::cw_stop");
	if (m_state == SmdSatState::stopped) return true;

	uint8_t payload[7] = { 0x00, 0, 0, 0, 0, 0, 0 };  // mode = stop
	try {
		m_cmd.write_cw(payload, sizeof(payload));
		return true;
	} catch (...) {
		DEBUG_ERROR("SmdSat::cw_stop: write_cw threw");
		return false;
	}
}

std::string SmdSat::get_firmware_version() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		power_on_blocking();
	}

	std::string version = "";

	try {
		bool smd_ready = !was_stopped || m_cmd.ping();  // Already pinged in power_on_blocking

		if (smd_ready) {
			uint8_t ver[64] = { 0 };
			m_cmd.read_version(ver);
			size_t len = 0;
			while (len < sizeof(ver) && ver[len] != 0 && ver[len] >= 0x20 && ver[len] < 0x7F) {
				len++;
			}
			version = std::string((char *)ver, len);
			DEBUG_INFO("SmdSat::%s: Firmware version: %s", __func__, version.c_str());
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: Failed to read firmware version", __func__);
	}

	if (was_stopped) {
		m_cmd.deinit();
		shutdown();
		GPIOPins::release_sensors_pwr();
		nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	}

	return version;
}

std::string SmdSat::smd_spi_test() {
	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		DEBUG_INFO("SmdSat::%s: Powering on SMD for test...", __func__);
		power_on_blocking();
	}

	std::string result = m_cmd.run_command_test();

	if (was_stopped) {
		DEBUG_INFO("SmdSat::%s: Powering off SMD after test", __func__);
		m_cmd.deinit();
		shutdown();
		GPIOPins::release_sensors_pwr();
		nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	}

	return result;
}
